#define _GNU_SOURCE
#include <sched.h>
#include <stdio.h>
#include <unistd.h>
#include <sys/mman.h>
#include <errno.h>
#include <pthread.h>
#include <sys/prctl.h>
#include <time.h>
#include <stdint.h>

#include "ecrt.h"

enum SERON_OPERATION_MODE
{
    NoMode = 0,
    PpMode = 1,
    PvMode = 3,
    TqMode = 4,
    HmMode = 6,
    IpMode = 7,
    CspMode = 8,
    CsvMode = 9,
    CstMode = 10,
};

typedef struct atomic_t
{
    volatile int counter;
} atomic_t;

#define dc_user

#define D_TARGET_CPU 1
#define D_PRIORITY 95


#define D_MAX_DOMAINS_PER_MASTER 1

#define D_MAX_SLAVES_PER_MASTER 32

#define D_SM_TIME 125 * 1000

#define D_SHITE_TIME (D_SM_TIME / 2)

#define TC 0x00075500, 0x00000002 // TC

static unsigned int counter = 0;
static unsigned int blink = 0;

/****************************************************************************/

#define FREQUENCY 1000

#define NSEC_PER_SEC (1000000000L)

#define DIFF_NS(A, B) (((B).tv_sec - (A).tv_sec) * NSEC_PER_SEC + \
                       (B).tv_nsec - (A).tv_nsec)

#define TIMESPEC2NS(T) ((uint64_t)(T).tv_sec * NSEC_PER_SEC + (T).tv_nsec)

/*****************************************************************************/

/* Master 0, Slave 0, "TC200E CoE Drive"
 * Vendor ID:       0x00075500
 * Product code:    0x00000000
 * Revision number: 0x00000002
 */

#pragma pack(push, 1)

// offsets for PDO entries
typedef struct S_Ecat_Offset
{
    // write
    unsigned int TargetCurrent;  /*0x6071 int16*/
    unsigned int ControlWord;    /* ¿ØÖÆ×Ö    0x6040 uint16*/
    unsigned int TargetPosition; /* Ä¿±êÎ»ÖÃ  0x607A int32*/
    unsigned int TargetSpeed;    /* Ä¿±êËÙ¶È  0x60FF int32*/
    unsigned int OperationMode;  /* ¿ØÖÆÄ£Êœ  0x6060 uint8*/

    // read
    unsigned int Temperature;  /*0x300F uint16*/
    unsigned int TorqueSensor; /*0x303A current torque int32*/
    unsigned int ErrorStatus;  /*0x603F uint16*/
    unsigned int StatusWord;   /* ×ŽÌ¬×Ö    0x6041 uint16*/
    unsigned int ActPos;       /* ÊµŒÊÎ»ÖÃ  0x6064 int32*/
    unsigned int ActSpeed;     /* 0x606C int32*/
    unsigned int Current;      /*0x6077 int16*/
    unsigned int Voltage;      /*0x6079 uint32*/

} S_Ecat_Offset;

// offsets for PDO entries
typedef struct S_Ecat_Value
{
    // write
    int16_t TargetCurrent;  /* 0x6071 int16*/
    uint16_t ControlWord;   /* ¿ØÖÆ×Ö    0x6040 uint16*/
    int32_t TargetPosition; /* Ä¿±êÎ»ÖÃ  0x607A int32*/
    int32_t TargetSpeed;    /* Ä¿±êËÙ¶È  0x60FF int32*/
    uint8_t OperotionMode;  /* ¿ØÖÆÄ£Êœ  0x6060 uint8*/

    // read
    uint16_t Temperature; /*0x300F uint16*/
    int32_t TorqueSensor; /*0x303A current torque int32*/
    uint16_t ErrorStatus; /*0x603F uint16*/
    uint16_t StatusWord;  /* ×ŽÌ¬×Ö    0x6041 uint16*/
    int32_t ActPos;       /* ÊµŒÊÎ»ÖÃ  0x6064 int32*/
    int32_t ActSpeed;     /* 0x606C int32*/
    int16_t Current;      /*0x6077 int16*/
    uint32_t Voltage;     /*0x6079 uint32*/

} S_Ecat_Value;


//modified here
#define D_MASTER0_SLAVE_COUNT 7


S_Ecat_Offset s_Master0_EcatOffset[D_MASTER0_SLAVE_COUNT];
S_Ecat_Value s_Master0_EcatValue[D_MASTER0_SLAVE_COUNT];



// PDO注册条目结构
typedef struct S_PdoEntryConfig
{
    int master_index;
    int slave_position;
    uint32_t vendor_id;
    uint32_t product_code;
    uint16_t index;
    uint8_t subindex;
    uint8_t bit_length;
    unsigned int *offset_ptr;
} S_PdoEntryConfig;

//============================================================================//

ec_pdo_entry_info_t servo_pdo_entries[] = {
    //==========write================
    {0x6071, 0x00, 16}, /* uint16 */
    {0x6040, 0x00, 16}, /* uint16 */
    {0x607A, 0x00, 32}, /* int32 */
    {0x60FF, 0x00, 32}, /* int32 */
    {0x6060, 0x00, 8},  /* uint8 */

    //========read======================
    {0x300F, 0x00, 16}, /* uint16 */
    {0x303A, 0x00, 32}, /* int32 */
    {0x603F, 0x00, 16}, /* uint16 */
